# 06: Mengganti nama (label) kolom pada Data Frame

# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

# Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  6  1  3  3  3
1  1  9  8  9  5
2  5  4  4  1  6
3  9  8  4  5  8
4  3  5  5  7  8

# Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [5]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  6  1     3  3  3
1  1  9     8  9  5
2  5  4     4  1  6
3  9  8     4  5  8
4  3  5     5  7  8

# Mengganti nama (label) untuk banyak kolom pada Data Frame

In [7]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     6       1  3     3  3
1     1       9  8     9  5
2     5       4  4     1  6
3     9       8  4     5  8
4     3       5  5     7  8